Netology/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуСтроки()
	ТекущиеДанныеТаблицы = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
    ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Количество * ТекущиеДанныеТаблицы.Цена	
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	Объект.Товары.Сортировать("Сумма Убыв");
КонецПроцедуры


&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокиСНоменклатурой = Новый Структура("Номенклатура", ВыбранныеДанные.Номенклатура);
		ВыбраннаяНоменклатура = Объект.Товары.НайтиСтроки(СтрокиСНоменклатурой);
		Если ВыбраннаяНоменклатура.Количество() > 0 Тогда
			НайденнаяСтрока = ВыбраннаяНоменклатура[0];
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ВыбранныеДанные.Количество;
		Иначе
			СтрокаТаблицы = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		КонецЕсли;  
		ПересчитатьСуммуСтроки();
	КонецЦикла;  
	
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда) 
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);  
КонецПроцедуры
